







others_answer={
    "no_answer":[
        "我还小，听不懂你在说什么呀~",
        "啊这，我听不懂~发送help可以了解怎样教我说话~",
        "说的什么呀，我好像听不懂",
        "我好像不太明白，呜呜呜~我好笨~",
        "嘤嘤嘤，我听不懂啦~",
        "太难了，我理解不了，快来帮我扩充语言库吧~",
        "听不懂了呀，能不能教教我~",
        "这超出我的理解范围了~教教我好不好~",
        "教我说话的功能完全开放了呀~教我整两句骚话好不好",
        "听不懂了呀~现在大家都可以教我说话啦，发送help试试吧"
        "好难~我听不懂~私聊就可以教我说话啦~"
    ]
}
base_talk_data=[
    ["曹议是谁",["是我爸爸~","当然是我爸爸啦~~","是创造我的那个人呀~","这还问我？我相信你是知道的~"]],
    ["你是谁的",["我是大家的Hex酱~希望大家教我说更多的话","我是属于大家的啦~"]],
    ["你爸爸是谁",["当然是Am473ur啦~"]]
]

right_answer={
    "add_data_success":[
        "添加记录成功~",
        "好啦~",
        "添加完成~"
    ],
    "del_data_success":[
        "删除记录成功~",
        "好啦~",
        "删除完成~"
    ]
}

except_answer={
    "add_data_hint_0":[
        "偷偷告诉你，你可以像这样教我说话：你是谁+我是Hex酱~",
        "调教我的时候，别忘了在两句话之间用加号(+)分隔~",
        "教我说话的时候，要保证有且仅有一个加号(+)哟~~"
    ],
    "add_data_hint_1":[
        "加号的前面和后面都不能为空啊~",
        "加号前面和后面都整点骚话呀~~"
    ],
    "add_data_hint_2":[
        "“|”和“/”我可不不认识~",
        "教我说的话里面可不能有“|”和“/”哦~",
        "啊这，“|”和“/”我不认识呀~",
    ],
    "add_data_hint_3":[
        "我也不是小孩子啦~这么短的话就不用教我啦~",
        "教我说的话长度要大于等于三~",
        "教我说长一点的话好不好啊~"
    ],
    "add_data_hint_4":[
        "哼，这句话我已经会啦，不用教啦~",
    ],
    "del_data_hint_0":[
        "删除记录格式为：rm关键词1+关键词2",
        "别把两个关键词之间的加号(+)丢了呀"
    ],
    "del_data_hint_1":[
        "删除记录格式为：rm关键词1+关键词2",
        "加号(+)前面和后面都要有关键词啊~",
        "加号(+)前面或后面好像少了点东西？",
    ],
    "del_data_hint_2":[
        "QAQ没有找到这两个词的关联，删除失败~",
        "我咋没发现这个两个词有关联呀~再检查一下吧~",
        "好像这两个关键词没有对应关系啊，删除失败了~"
    ]
}
